### Design synthesis
### Usage: yosys -s factorization.ys -b edif -o factorization.edif factorization.v

# Check design hierarchy.
hierarchy -top Query

# Translate processes.
proc; opt

# Detect and optimize FSM encodings.
fsm; opt

# Convert to gate logic.
techmap; opt

# Recast in terms of more gate types.
abc -g AND,NAND,OR,NOR,XOR,XNOR,MUX,AOI3,OAI3,AOI4,OAI4; opt

# Clean up.
clean
